### 静态路由配置

![image-20220404170857302](C:\Users\lenovo\AppData\Roaming\Typora\typora-user-images\image-20220404170857302.png)

```shell
## 基本命令
### 配置路由器 0/0 端口 ip
R(config)#int f 0/0
R(config-if)#ip address <IP地址> <掩码>
R(config-if)#no shutdown
### 配置静态路由
R(config)#ip address <目标网段> <掩码> <下一跳路由器端口地址(IP地址)>

## 例子，实现PC0和PC1的互ping
## PC0 配置ip 和 网关地址: 192.168.1.1 和 192.168.1.254
## PC1 配置ip 和 网关地址: 192.168.2.1 和 192.168.2.254

### 配置R0端口ip
R0(config)#int f 0/0
R0(config-if)#ip address 192.168.1.254 255.255.255.0
R0(config-if)#no shutdown
...
R0(config)#int f 0/1
R0(config-if)#ip address 192.168.5.1 255.255.255.0
R0(config-if)#no shutdown
...
R0(config)#ip route 192.168.2.0 255.255.255.0 192.168.5.2

### 配置R1端口ip
R1(config)#int f 0/0
R1(config-if)#ip address 192.168.2.254 255.255.255.0
R1(config-if)#no shutdown
...
R1(config)#int f 0/1
R1(config-if)#ip address 192.168.5.2 255.255.255.0
R1(config-if)#no shutdown
...
R0(config)#ip route 192.168.1.0 255.255.255.0 192.168.5.1
```

### NAT

#### 静态NAT

![image-20220407083409477](C:\Users\lenovo\AppData\Roaming\Typora\typora-user-images\image-20220407083409477.png)

```shell
## local-ip:路由器中的内网接口 192.168.1.10
## global-ip:路由器中的外网接口 202.100.1.10
R(config)#ip nat inside source static <local-ip> <global-ip>
## 内网接口
R(config)#int f 0/0
R(config-if)#ip nat inside
## 外网接口
R(config)#int f 0/1
R(config-if)#ip nat outside

R#show ip nat translations
```

#### 动态NAT

![image-20220407084653321](C:\Users\lenovo\AppData\Roaming\Typora\typora-user-images\image-20220407084653321.png)

```shell
## name:ip池自定义名称
## start-ip和end-ip:为ip池中的起始ip地址和结束ip地址 可选择的内部全局ip地址
## 此处应为 ip nat pool <name> 202.100.1.3 202.100.1.100 netmask 255.255.255.0 (不能和路由器端口或服务器ip重合)
## netmask:掩码
R(config)#ip nat pool <name> <start-ip> <end-ip> netmask <netmask>
## access-list-number:list的自定义编号
## source:内部本地地址和范围
R(config)#access-list <access-list-number> permit <source>
####: 例子: access-list 1 permit 192.168.1.0 0.0.0.255
R(config)#ip nat inside source list <access-list-number> pool <name>
## 内网接口
R(config)#int f 0/0
R(config-if)#ip nat inside
## 外网接口
R(config)#int f 0/1
R(config-if)#ip nat outside
```

![image-20220407085211846](C:\Users\lenovo\AppData\Roaming\Typora\typora-user-images\image-20220407085211846.png)

#### PAT

![image-20220407085425285](C:\Users\lenovo\AppData\Roaming\Typora\typora-user-images\image-20220407085425285.png)

```shell
## access-list-number:list的自定义编号
## source:内部本地地址和范围
##: 例子: access-list 1 permit 192.168.1.0 0.0.0.255
R(config)#access-list <access-list-number> permit <source>
## 此处的interface为外网接口 此处为 f 0/1
R(config)#ip nat inside source list <access-list-number> interface <interface> overload
## 内网接口
R(config)#int f 0/0
R(config-if)#ip nat inside
## 外网接口
R(config)#int f 0/1
R(config-if)#ip nat outside
```

![image-20220407085804288](C:\Users\lenovo\AppData\Roaming\Typora\typora-user-images\image-20220407085804288.png)



#### 关于D-NAT和PAT之间的差异：

看下图可以看出当改变主机（IP地址）时，PAT的IP地址没有改变，只是端口号发生了变化；而D-NAT的IP的地址发生了改变，仍然是1对1映射的。

##### pat

![image-20220407100930115](C:\Users\lenovo\AppData\Roaming\Typora\typora-user-images\image-20220407100930115.png)

##### d-nat

![image-20220407101238867](C:\Users\lenovo\AppData\Roaming\Typora\typora-user-images\image-20220407101238867.png)

### DHCP

![image-20220424172121083](C:\Users\lenovo\AppData\Roaming\Typora\typora-user-images\image-20220424172121083.png)

- 在服务器上开启DHCP服务

- 配置服务器的IP地址、默认网关

- 配置路由器的ip地址

- 配置路由器的静态路由

- 在Router0上添加两个DHCP服务

  ```shell
  # ip dhcp pool <pool-name>
  # network <address> <netmask> 配置网段信息
  # default-router <address> 配置默认网关
  R(config)#ip dhcp pool cc
  R(dhcp-config)#network 192.168.1.0 255.255.255.0
  R(dhcp-config)#default-router 192.168.1.1
  R(dhcp-config)#exit
  
  R(config)#ip dhcp pool dd
  R(dhcp-config)#network 192.168.2.0 255.255.255.0
  R(dhcp-config)#default-router 192.168.2.1
  R(dhcp-config)#exit
  
  # ip helper-address <ip-address> 由于客户端与服务器不在同一个广播域，路由器需要转发，ip-address是dhcp服务器地址
  R(config)#int fa 0/0
  R(config-if)#ip helper-address 192.168.3.2
  R(config-if)#exit
  R(config)#int fa 0/1
  R(config-if)#ip helper-address 192.168.3.2
  R(config-if)#exit
  ```

- pc自动获取ip地址(DHCP)